# GetParameterValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..GetParameterValue Method
Subelement Class See Also
---
Obtains the current parameter value of this subelement given a parameter id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ParameterValue GetParameterValue(
	ElementId parameterId
)
```

Visual Basic
---
```text
Public Function GetParameterValue ( _
	parameterId As ElementId _
) As ParameterValue
```

Visual C++
---
```text
public:
ParameterValue^ GetParameterValue(
	ElementId^ parameterId
)
```

# ### Parameters
parameterId
    Type: Autodesk.Revit.DB..::..ElementId Parameter id.
# ### Return Value
Parameter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | parameterId does not identify a valid parameter of this subelement. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Subelement Class
Autodesk.Revit.DB Namespace